# -*- coding: utf-8 -*-
"""Копия блокнота ""Практика 0.2.0 .ipynb""

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/13yuPrebjgc12dUJb0iQlfTXiQDgZKrtd

Напишите свое ФИО:
"""



"""Копьев Данила Александрович

# Основы

Задание 1: Напиши программу, выводящую на экран сообщение "Привет, мир!"
"""

print('Привет, мир!')

"""Задание 2: Напиши программу которая запрашивает имя пользователя и выводит сообщение:

`Привет, <Имя пользователя>`
"""

a = input()
print(f'Привет, {a}')

"""Задание 3: Напиши программу определяющую является ли число четным или нечетным:

Пример:

`Введите число:` 2

`Ваше число четное!`
"""

a = int(input('Введите число: '))
if a // 2 * 2 == a:
  print('Ваше число четное!')

"""Задание 4: Напишите программу которая запрашивает длинну и ширину прямоугольника и выводит его площадь:



`Введите длинну прямоугольника:`

`Введите ширину прямоугольника:`

`Площадь прямоугольника: `


"""

a = int(input('Введите длинну прямоугольника: '))
b = int(input('Введите ширину прямоугольника: '))
print('Площадь прямоугольника:', a * b)

"""Задание 5: Напишите программу, которая будет вычислять среднее арифметическое введенных чисел"""

numbers = 0
i = 1
print('Введите число, после чего нажмите Enter.')
while True:
  print('Нажмите Enter, если надоело писать числа')
  number = input('')
  if number == '':
    break
  else:
    numbers += int(number)
    res = numbers / i
    i += 1
print(res)

"""Задание 6: Напиши программу, которая бы определяла является ли год високосным"""

year = int(input('Введите любой год: '))
if year % 100 // 4 * 4 == year:
  print('Введенный год - високосный!')
else:
  print('Введенный год - не високосный =(')

"""Задание 7: Необходимо создать простой калькулятор, который позволяет пользователю выбрать одну из четырёх операций (+, -, *, /), ввести два числа и получить результат выполнения операции."""

print('Введите номер нужной вам операции:')
number_operation = int(input('1 - "+", 2 - "-", 3 - "/", 4 - "*": '))
number_1 = float(input('Введите первое число: '))
number_2 = float(input('Введите второе число: '))
if number_operation == 1:
  res = number_1 + number_2
elif number_operation == 2:
  res = number_1 - number_2
elif number_operation == 3:
  res = number_1 / number_2
elif number_operation == 4:
  res = number_1 * number_2
print(res)

"""# Практика 0.2.1

**Шахматы**

Даны стартовые и конечные координаты, а также фигура

Необходимо определить, может ли заданная фигура так ходить?
"""

piece = input('Введите имя бравого воина с маленькой буквы: ')
print('Пусть обе оси (X и Y) будут отсчитываться натуральными числами от 1 до 8.')
print('Примем так-же тот факт, что пешки не могут находиться на 1-ой горизонтали')
print('Введите 4 координаты через enter, где первые две - начальные, вторые две - конечные.')
print('p.s.: сначала X потом Y.')
x_st, y_st = int(input()), int(input())
x_fin, y_fin = int(input()), int(input())
i = 1

if piece == 'слон':
    while i != 9:
        if x_fin == (x_st + i) and y_fin == (y_st + i):
            print('Может')
            break
        elif x_fin == (x_st - i) and y_fin == (y_st + i):
            print('Может')
            break
        elif x_fin == (x_st + i) and y_fin == (y_st - i):
            print('Может')
            break
        elif x_fin == (x_st - i) and y_fin == (y_st - i):
            print('Может')
            break
        else:
            if i < 9:
                i += 1
            else:
                print('Не может')
                break

elif piece == 'ладья':
    while i != 9:
        if x_fin == (x_st + i) and y_fin == y_st:
            print('Может')
            break
        elif x_fin == x_st and y_fin == (y_st + i):
            print('Может')
            break
        elif x_fin == x_st and y_fin == (y_st - i):
            print('Может')
            break
        elif x_fin == (x_st - i) and y_fin == y_st:
            print('Может')
            break
        else:
            if i < 9:
                i += 1
            else:
                print('Не может')
                break

elif piece == 'ферзь' or 'королева':
    while i != 9:
        if x_fin == (x_st + i) and y_fin == (y_st + i):
            print('Может')
            break
        elif x_fin == (x_st - i) and y_fin == (y_st + i):
            print('Может')
            break
        elif x_fin == (x_st + i) and y_fin == (y_st - i):
            print('Может')
            break
        elif x_fin == (x_st - i) and y_fin == (y_st - i):
            print('Может')
            break
        elif x_fin == (x_st + i) and y_fin == y_st:
            print('Может')
            break
        elif x_fin == x_st and y_fin == (y_st + i):
            print('Может')
            break
        elif x_fin == x_st and y_fin == (y_st - i):
            print('Может')
            break
        elif x_fin == (x_st - i) and y_fin == y_st:
            print('Может')
            break
        else:
            if i < 9:
                i += 1
            else:
                print('Не может')
                break

elif piece == 'конь':
    if x_fin == (x_st + 1) and y_fin == (y_st + 2):
        print('Может')
    elif x_fin == (x_st + 2) and y_fin == (y_st + 1):
        print('Может')
    if x_fin == (x_st - 1) and y_fin == (y_st + 2):
        print('Может')
    elif x_fin == (x_st - 2) and y_fin == (y_st + 1):
        print('Может')
    if x_fin == (x_st + 1) and y_fin == (y_st - 2):
        print('Может')
    elif x_fin == (x_st + 2) and y_fin == (y_st - 1):
        print('Может')
    if x_fin == (x_st + 1) and y_fin == (y_st + 2):
        print('Может')
    elif x_fin == (x_st - 2) and y_fin == (y_st - 1):
        print('Может')
    else:
        print('Не может')

elif piece == 'король':
    if x_fin == (x_st + 1) and y_fin == (x_st + 1):
        print('Может')
    elif x_fin == (x_st - 1) and y_fin == (x_st + 1):
        print('Может')
    elif x_fin == (x_st + 1) and y_fin == (x_st - 1):
        print('Может')
    elif x_fin == (x_st - 1) and y_fin == (x_st - 1):
        print('Может')
    elif x_fin == x_st and y_fin == (y_st + 1):
        print('Может')
    elif x_fin == x_st and y_fin == (y_st - 1):
        print('Может')
    elif x_fin == (x_st + 1) and y_fin == y_st:
        print('Может')
    elif x_fin == (x_st - 1) and y_fin == y_st:
        print('Может')
    else:
        print('Не может')

elif piece == 'пешка':
    if y_st == 2 and y_fin == (3 or 4) and x_fin == x_st:
        print('Может')
    elif y_fin == y_st + 1 and x_fin == x_st:
        print('Может')
    else:
        print('Не может')

"""# Практика 0.2.2

**Цифра на определенном месте:**

Последовательно записан натуральный ряд чисел.

Какая цифра стоит в N позиции
"""

print('Вводите числа через enter. Как только надоест нажмите enter без ввода числа.')
a = list()
while True:
  b = str(input('Введите число: '))
  if b == "":
    break
  else:
    a.append(b)
pos = int(input('Введите N-ую позицию : '))
finished = ''.join(a)
i = len(finished)
print((int(finished) // (10 ** (i - pos))) % 10)

"""# Практика 0.2.3


Возьмите код из задания 7 и улучшите ваш калькулятор следующим образом:

Пользователь вводит строку вида:

(5+5)*5 - данная строка содержит в себе математическое выражение, а также скобки

Ваша программа должная понять что за математическое выражение записано, проверить верно ли оно записано (пример неверного заполнения: (5(+)5)*5, а также расчитать его в соотвествии с правилами математики
"""



