# -*- coding: utf-8 -*-
"""Копия блокнота "Практика 0.3.0.ipynb"

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1KmLcCtp7eHvWZcgnpPRuJUQSQplZPbuY

ФИО

Копьев Данила Александрович
"""



"""**Во всей практике нельзя применять библиотеки предоставляющие готовые решения!**

# **Задача 1.**

Типы данных Напишите программу на Python, которая принимает список чисел в качестве входных данных от пользователя, а затем выводит сумму, среднее значение и максимальное значение из списка.

***Нельзя использовать: len(), min(), max(), average(), sum()***

Дано:
```
1 2 3 4 5 6 7
```
Вывод:

```
Сумма чисел: 28
Среднее арифм.: 4.0
Максимальное значение: 7
```
"""

from re import L
a = input().split(' ')
i = len(a)
summ = 0
maxx = 0
k = 0
while k != i:
  if int(maxx) >= int(a[k]):
    k += 1
  else:
    maxx = a[k]
for i in range(0, i):
  summ += int(a[i])
print(f'Сумма чисел: {summ}')
print(f'Среднее арифм.: {summ / i}')
print(f'Максимальное значение: {maxx}')

"""# **Задача 2.**

Напишите программу на Python, которая принимает список слов в качестве входных данных от пользователя, а затем распечатывает список в обратном порядке.

Ввод:

```
апельсин мандарин яблоко
```

Вывод:

```
яблоко мандарин апельсин
```
"""

spisok = input().split(' ')
fin_spisok = reversed(spisok)
print(' '.join(fin_spisok))

"""# **Задача 3**

Простой чат-бот
Создайте простого чат-бота, который отвечает на основные запросы пользователей. Программа должна использовать условные выражения для определения намерений пользователя и последующего соответствующего ответа.

Чат бот может:

- помогать складывать числа
- подсказывать фильм, музыку и тд (из заранее созданного списка)
- создавать список дел (а также выводить его, обновлять, очищать)

Интерфейс чат-бота на ваше усмотрение, это могут быть как заранее определенные команды, так и к примеру вызов команды по номеру

*Реализовать без использования функций*

Пример:

Ввод:

```
Олег, какую мызыку посоветуешь?
```

Вывод:

```
Я бы посоветовал вам: Led Zeppelin Stairway to Heaven
```
"""

print('\nВас приветствует чат-бот Максон и я способен выполнять следующие операции:'
'\n1. Помогать складывать числа'
'\n2. Подсказывать фильм, музыку и тд'
'\n3. Создавать список дел'
'\n4. Выход\n')
while a != 4:
  a = int(input('Введите число для будущей операции из выше перечисленных (без точки): '))

  if a == 1:
    integers = input('\nВведите числа через пробел: ').split(' ')
    i = len(integers)
    zero = 0
    summ = sum(int(integers[zero]) for zero in range(0, i))
    print(f'Сумма данных чисел равна {summ}')
  elif a == 2:
    next = int(input('Что вам посоветовать?'
    '\n1. Фильм'
    '\n2. Музыка\n'
    '\nВведите число из перечисленных выше: '))
    if next == 1:
      print('Я бы посоветовал вам посмотреть фильм \'Волк с Уолл Стрит\'')
    else:
      print('Я бы посоветовал вам послушать трек \'Черный русский\'')
  elif a == 3:
    spisok_del = []
    print('Вас приветствует мастер списка дел.'
    '\nДанный мастер способен выполнять следующие команды:'
    '\n1. Добавить в список дело'
    '\n2. Убрать из списка дело'
    '\n3. Очистить весь список'     #Данная программа является оригиналом (в случае списывания)
    '\n4. Вывести список дел'
    '\n5. Закрыть мастер списков дел\n')
    check = int(input('Введите число из перечисленных выше: '))
    while check != 5:
      if check == 1:
        print('Введите желаемые дела через enter. Когда закончится желание просто нажмите enter: ')
        x = input()
        while x != '':
          spisok_del.append(x)
          x = input()
      elif check == 2:
        print('Введите дело, которое нужно удалить из списка: ')
        y = input()
        while y != '':
          spisok_del.remove(y)
          y = input()
      elif check == 3:
        print('Список дел был стерт')
        spisok_del.clear()
      elif check == 4:
        print(spisok_del)
      else:
        break
      print('\nВас приветствует мастер списка дел.'
'\nДанный мастер способен выполнять следующие команды:'
'\n1. Добавить в список дело'
'\n2. Убрать из списка дело'
'\n3. Очистить весь список'     #Данная программа является оригиналом (в случае списывания)
'\n4. Вывести список дел'
'\n5. Закрыть мастер списков дел')
      check = int(input('Введите число из перечисленных выше: '))
  else:
    break

"""# **Задача 4.**

Камень, ножницы, бумага

Создайте игру в Камень, ножницы, бумагу, в которой пользователь может играть против компьютера. Программа должна запросить выбор пользователя, а затем сгенерировать выбор компьютера. Затем программа должна определить победителя на основе правил игры.

**Этап 1:**

Определение победителя

**Этап 2:**
  
Игра до 3 побед


Ввод для "Этап 1":

```
Камень
```

Вывод:

```
Компьютер: Ножницы
Игрок: Камень
Победа: Игрок
```
"""

import random
print('Да начнется игра! Играем до 3-х побед)\n')
player = 0
bot = 0

while player != 3 or bot != 3:
  a_1 = input('Введите камень, ножницы или бумагу с маленькой буквы: ')
  print('\n')
  computer = random.randint(1, 3)

  if computer == 1:
    comp = 'камень'
  elif computer == 2:
    comp = 'ножницы'
  else:
    comp = 'бумага'

  print(f'Компьютер: {comp}')
  print(f'Игрок: {a_1}')

  if a_1 == 'камень':
    if computer == 1:
      print('Победа: Никто')
      player += 1
      bot +=1
    elif computer == 2:
      print('Победа: Игрок')
      player += 1
    else:
      print('Победа: Компьютер')
      bot += 1

  elif a_1 == 'ножницы':
    if computer == 2:
      print('Победа: Никто')
      player += 1
      bot +=1
    elif computer == 3:
      print('Победа: Игрок')
      player += 1
    else:
      print('Победа: Компьютер')
      bot += 1

  else:
    if computer == 3:
      print('Победа: Никто')
      player += 1
      bot +=1
    elif computer == 1:
      print('Победа: Игрок')
      player += 1
    else:
      print('Победа: Компьютер')
      bot += 1
  print(f'Счет: Игрок - {player} : Компьютер - {bot}\n')
if bot == 3 and player == 3:
  print('Ничья!')
elif bot == 3 and player <3:
  print('Победил компьютер!')
else:
  print("Победил человек!к")

"""# **Задача 5.**

Создайте игру "Палач" или "Виселица", в которой пользователь должен угадать слово, предлагая буквы. Программа должна выбрать случайное слово, а затем разрешить пользователю угадывать буквы. После каждого угадывания программа должна сообщать пользователю, есть ли в слове буква или нет.

**Этап 1**
Создать саму игру

**Этап 2:**
Ввести подсчет количества очков и ограничения на попытки

**Этап 3:** Добавить возможность сразу угадать слово
"""

print('Вас приветствует игра \"Виселица\".\n'
'В этой игре у вас будет 6 попыток угадать все буквы загаданого слова.\n'
'Введите букву, которая (как вы считаете) должна подойти: ')

start = 'флюорография'
word = list(start)
word_for_work = list(set(word))
attempts = ['одна попытка', 'две попытки', 'три попытки', 'четыре попытки', 'пять попыток']
i = 5

letter = input().lower()
while i != 0 and len(word_for_work) - 1 != 0:
  if letter in word:
    try:
      word_for_work.remove(letter)
      print('Буква(ы) угадана(ы). Продолжим')
    except ValueError:
      print('Введенная буква уже вводилась ранее.')
  else:
    i -= 1
    print(f'У вас осталось {attempts[i]}')
  letter = input().lower()

if i == 0:
  print('Вы проиграли')
elif len(word_for_work) - 1 == 0:
  print(f'Вы выиграли! Загаданное слово: {start}')
р

"""# **Дополнительно: Задача 6.**

**Цифра на определенном месте:**

Последовательно записан натуральный ряд чисел.

Какая цифра стоит в N позиции


Вввод:

```
Введите номер позиции: 1234567890
```

Вывод:

```
8
```
"""

